---
kind: other
id: Methods.T:Autodesk.Revit.DB.SpatialElement
source: html/20cda3e6-996c-cfdf-b665-7944efd4f89e.htm
---
# SpatialElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.